<!DOCTYPE html>
<html lang="en">

<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <link rel="stylesheet" href="../styles.css">
  <title>2.7.6 implement basic connect</title>
</head>

<body>
  <main>
    <h1>2.7.6 implement basic connect</h1>
  </main>

  <h2>Instructions</h2>
  <h3>
    Part 1: Perform a Basic Configuration on S1 and S2 <br>
    Complete the following steps on S1 and S2.
  </h3>

  <p>
    Step 1: Configure S1 with a hostname. <br>
    a.     Click S1 and then click the CLI tab.
  </p>
  <p>
    b.     Enter the correct command to configure the hostname as S1. <br>
    	switch> enable <br>
    	switch# configure terminal <br>
	switch(config)# hostname s1 <br>
	s1(config)# 
  </p>
  <p>
    Step 2: Configure the console and encrypted privileged EXEC mode passwords. <br>
    a.     Use cisco for the console password. <br>
	s1# configure terminal <br>
	s1(config)# line console 0 <br>
 	s1(config-line)# password cisco <br>
	s1(config-line)# login <br>
	s1(config-line)# end <br>
	s1#
  </p>
  <p>
    b.     Use class for the privileged EXEC mode password. <br>
	s1# configure terminal <br>
	s1(config)# enable secret class <br>
	s1(config)# exit <br>
	s1# 
  </p>
  <p>
    Step 3: Verify the password configurations for S1.
  </p>
  <p>
    Question: 
    How can you verify that both passwords were configured correctly? <br>
  </p>
	exit <br>
	User Access Verification <br>
	Password: cisco <br>
  <p>
	s1> enable <br>
	Password: class <br>
	s1#
  </p>
  <p>Use an appropriate banner text to warn unauthorized access. The following text is an example:</p>

  <p>Authorized access only. Violators will be prosecuted to the full extent of the law.</p>
  <p>
    s1# configure terminal <br>
    s1(config)# banner motd # Authorized access only. Violators will be prosecuted ... law.#
  </p>

  <p>Step 4: Save the configuration file to NVRAM. </p>
  <p>
    Question: <br>
    Which command do you issue to accomplish this step?
  </p>
  <p>
    s1# copy running-config startup-config
  </p>

  <p>Step 5: Repeat Steps 1 to 5 for S2. </p>

  <h3>Part 2: Configure the PCs <br>
    Configure PC1 and PC2 with IP addresses.
  </h3>
  <p>
    Step 1: Configure both PCs with IP addresses. <br>
	a.     Click PC1 and then click the Desktop tab. <br>

	b.     Click IP Configuration. In the Addressing Table above, you can see that the IP address for PC1 is 192.168.1.1 and the subnet mask is 255.255.255.0. Enter this information for PC1 in the IP Configuration window. <br>

	c.     Repeat steps 1a and 1b for PC2.
  </p>
  <p>
    Step 2: Test connectivity to switches. <br>
	a.     Click PC1. Close the IP Configuration window if it is still open. In the Desktop tab, click Command Prompt. <br>

	b.     Type the ping command and the IP address for S1 and press Enter.
  </p>
  <p>
    Packet Tracer PC Command Line 1.0 <br>

    PC> ping 192.168.1.253
  </p>
  <p>
    Question: <br>
	Were you successful? Explain. <br>
	Ans: Switch S1 does not have ip address 192.168.1.253 configured yet.
  </p>

  <h3>Part 3: Configure the Switch Management Interface <br>
    Configure S1 and S2 with an IP address.
  </h3>
  <p>
    Step 1: Configure S1 with an IP address. <br>
    Switches can be used as plug-and-play devices. This means that they do not need to be configured for them to work. Switches forward information from one port to another based on MAC addresses.
  </p>
  <p>
    Question:<br>
    If this is the case, why would we configure it with an IP address? <br>
    Ans: To access the switch remotely, an IP address and a subnet mask must be configured on the SVI
  </p>
  <p>
  Use the following commands to configure S1 with an IP address. <br>

	S1# configure terminal
  </p>
  <p>
    Enter configuration commands, one per line. End with CNTL/Z. <br>

        S1(config)# interface vlan 1 <br>

	S1(config-if)# ip address 192.168.1.253 255.255.255.0 <br>

	S1(config-if)# no shutdown <br>

	%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, changed state to up <br>

	S1(config-if)# <br>

	S1(config-if)# exit <br>

	S1#
  </p>
  <p>
    Question: <br>
    Why do you enter the no shutdown command? <br>
    Ans: To enable the virtual interface using the no shutdown command. <br>
  </p>
  <p>
    Step 2: Configure S2 with an IP address. <br>
    Use the information in the Addressing Table to configure S2 with an IP address.
  </p>
  <p>
    Step 3: Verify the IP address configuration on S1 and S2. <br>
    Use the show ip interface brief command to display the IP address and status of all the switch ports and interfaces. You can also use the show running-config command.
  </p>
  <p>
    Step 4: Save configurations for S1 and S2 to NVRAM.
  </p>
  <p>
    Question: <br>
    Which command is used to save the configuration file in RAM to NVRAM? <br>
    s1# copy running-config startup-config
  </p>
  <p>
    Step 5: Verify network connectivity. <br>
    Network connectivity can be verified using the ping command. It is very important that connectivity exists throughout the network. Corrective action must be taken if there is a failure. Ping S1 and S2 from PC1 and PC2. <br>
  
	a.     Click PC1 and then click the Desktop tab. <br>

	b.     Click Command Prompt. <br>

	c.     Ping the IP address for PC2. <br>

	d.     Ping the IP address for S1. <br>

	e.     Ping the IP address for S2. <br>

        Note: You can also use the ping command on the switch CLI and on PC2. <br>

	All pings should be successful. If your first ping result is 80%, try again. It should now be 100%. You will learn why a ping may sometimes fail the first time later in your studies. If you are unable to ping any of the devices, recheck your configuration for errors. <br>

  <p>End of Document 
  </p>
  <a href="../index.html">Go Back</a>
</body>

</html>
