<!DOCTYPE html>
<html lang="en">

<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <link rel="stylesheet" href="../styles.css">
  <title>CIML001 Week2 lab 2</title>
</head>

<body>
  <main>
    <h1>CIML002 Week 2 Lab 2</h1>
  </main>

  <h2>scenario</h2>
  <h3>
    As a recently hired LAN technician, your network manager has asked you to demonstrate your ability to configure a small LAN. Your tasks include configuring initial settings on two switches using the Cisco IOS and configuring IP address parameters on host devices to provide end-to-end connectivity. You are to use two switches and two hosts/PCs on a cabled and powered network.
  </h3>

  <p>
    Instructions <br>
    Configure the devices to fulfill the requirements below. <br>
  </p>
  <p>
    Requirements <br>
	Use a console connection to access each switch. <br>
	Connect lightning cable from PC (RS 232) to switch (console). Use terminal to access switch from PC. <br>
  </p>
  <p>
	Name Class-A and Class-B switches. <br>
	Switch>enable <br>
	Switch#configure terminal <br>
	Switch(config)#hostname Class-A or hostname Class-B <br>
	Class-A(config)# or CLass-B(config)# 
  </p>
  <p>
	Use the xAw6k password for all lines. <br>
	CLass-A(config)# line console 0 <br>
	CLass-A(config-line)# password xAw6k <br>
	Class-A(config-line)# login <br>
	Class-A(config-line)# end <br>
	Class-A#
  </p>
  <p>
	Use the 6EBUp secret password. <br>
	Class-A> enable <br>
	Class-A# configure terminal <br>
 	CLass-A(config)# enable secret 6EBUp <br>
	CLass-A(config)# exit <br>
	Class-A#
  </p>
  <p>
	Securing VTY line access <br>
	Class-A> enable <br>
	Class-A# configure terminal <br>
	Class-A(config)# line vty 0 15 <br>
	Class-A(config-line)# password xAw6k <br>
	Class-A(config-line)# login <br>
	Class-A(config-line)# end <br>
	Class-A#
  </p>
  <p>
	Encrypt all clear text passwords. <br>
	Class-A> enable <br>
	Class-A# configure terminal <br>
	Class-A(config)# service password-encryption <br>
	Class-A(config)# exit <br>
	Class-A#
  </p>
  <p>
	Configure an appropriate message-of-the-day (MOTD) banner. <br>
	Class-A# configure terminal <br>
	Class-A(config)# banner motd # Authorized access only. Violators will be prosecuted ... law.#
  </p>
  <p>
	Configure addressing for all devices according to the Addressing Table. <br>
	Class-A# configure terminal <br>
	Class-A(config)# interface VLAN 1 <br>
	Class-A(config-if)# ip address 10.10.10.100 255.255.255.0 or ip address 10.10.10.150 255.255.255.0 <br>
	Class-A(config-if)# no shutdown <br>
	Class-A(config-if)# <br>
	Class-A(config-if)# exit
  </p>
  <p>
	Save your configurations. <br>
	Class-A# copy running-config startup-config  
  </p>
  <p>
	Verify connectivity between all devices. <br>
	Click Student-1 PC and then click the Desktop tab. <br>
	Click IP Configuration. In the Addressing Table above, you can see that the IP address for PC1 is 10.10.10.4 and the subnet mask is 255.255.255.0. Enter this information for Student 1 PC in the IP Configuration window. <br>
	Repeat steps for Student-2 PC.
  </p>
  <p>
   	Click Student-1 PC. Close the IP Configuration window if it is still open. In the Desktop tab, click Command Prompt. <br>
	Type the ping command and the IP address for S1 and press Enter. <br>
	C:\> ping 10.10.10.100
  </p>
  <p>
	Note: Click Check Results to see your progress. Click Reset Activity to generate a new set of requirements. If you click on this before you complete the activity, all configurations will be lost.
  </p>
  <a href="../index.html">Go Back</a>
</body>

</html>